
export const provinces = [
    {
        "id": "20",
        "name": "安徽",
        "cities": [
            { "id": 282, "name": "安庆" }, { "id": 277, "name": "蚌埠" }, { "id": 289, "name": "亳州" },
            { "id": 287, "name": "巢湖" },
            { "id": 290, "name": "池州" }, { "id": 284, "name": "滁州" }, { "id": 285, "name": "阜阳" },
            { "id": 79, "name": "合肥" },
            { "id": 280, "name": "淮北" }, { "id": 278, "name": "淮南" }, { "id": 283, "name": "黄山" },
            { "id": 288, "name": "六安" },
            { "id": 279, "name": "马鞍山" }, { "id": 412, "name": "蒙城" }, { "id": 413, "name": "宁国" }, {
                "id": 286,
                "name": "宿州"
            }, { "id": 414, "name": "桐城" }, { "id": 281, "name": "铜陵" }, { "id": 80, "name": "芜湖" }, { "id": 291, "name": "宣城" }]
    },
    {
        "id": "33",
        "name": "澳门",
        "cities": [{ "id": 96, "name": "澳门" }]
    },
    {
        "id": "1",
        "name": "北京",
        "cities": [{ "id": 10, "name": "昌平区" }, { "id": 5, "name": "朝阳区" }, { "id": 4, "name": "崇文区" }, {
            "id": 11,
            "name": "大兴区"
        }, { "id": 1, "name": "东城区" }, { "id": 103, "name": "房山区" }, { "id": 7, "name": "丰台区" }, {
            "id": 6,
            "name": "海淀区"
        }, { "id": 12, "name": "怀柔区" }, { "id": 9, "name": "门头沟区" }, { "id": 13, "name": "密云县" }, {
            "id": 14,
            "name": "平谷区"
        }, { "id": 8, "name": "石景山区" }, { "id": 15, "name": "顺义区" }, { "id": 16, "name": "通州区" }, {
            "id": 2,
            "name": "西城区"
        }, { "id": 3, "name": "宣武区" }, { "id": 17, "name": "延庆县" }]
    },
    {
        "id": "26",
        "name": "福建",
        "cities": [{ "id": 415, "name": "福清" }, { "id": 87, "name": "福州" }, { "id": 416, "name": "建瓯" }, {
            "id": 417,
            "name": "晋江"
        }, { "id": 361, "name": "龙岩" }, { "id": 418, "name": "南安" }, { "id": 360, "name": "南平" }, {
            "id": 362,
            "name": "宁德"
        }, { "id": 357, "name": "莆田" }, { "id": 358, "name": "泉州" }, { "id": 356, "name": "三明" }, {
            "id": 419,
            "name": "邵武"
        }, { "id": 420, "name": "石狮" }, { "id": 88, "name": "厦门" }, { "id": 421, "name": "仙游" }, { "id": 359, "name": "漳州" }]
    }, {
        "id": "12",
        "name": "甘肃",
        "cities": [{ "id": 187, "name": "白银" }, { "id": 194, "name": "定西地区" }, { "id": 196, "name": "甘南藏族自治州" }, {
            "id": 422,
            "name": "嘉峪"
        }, { "id": 188, "name": "嘉峪关" }, { "id": 186, "name": "金昌" }, { "id": 192, "name": "酒泉" }, {
            "id": 63,
            "name": "兰州"
        }, { "id": 197, "name": "临夏回族自治州" }, { "id": 195, "name": "陇南地区" }, { "id": 191, "name": "平凉" }, {
            "id": 193,
            "name": "庆阳"
        }, { "id": 64, "name": "天水" }, { "id": 189, "name": "武威" }, { "id": 423, "name": "武威" }, { "id": 190, "name": "张掖" }]
    }, {
        "id": "24",
        "name": "广东",
        "cities": [{ "id": 340, "name": "潮州" }, { "id": 331, "name": "东莞" }, { "id": 334, "name": "佛山" }, {
            "id": 84,
            "name": "广州"
        }, { "id": 327, "name": "河源" }, { "id": 424, "name": "花都" }, { "id": 329, "name": "惠州" }, {
            "id": 333,
            "name": "江门"
        }, { "id": 341, "name": "揭阳" }, { "id": 425, "name": "开平" }, { "id": 337, "name": "茂名" }, {
            "id": 328,
            "name": "梅州"
        }, { "id": 426, "name": "南海" }, { "id": 339, "name": "清远" }, { "id": 325, "name": "汕头" }, {
            "id": 330,
            "name": "汕尾"
        }, { "id": 326, "name": "韶关" }, { "id": 85, "name": "深圳" }, { "id": 431, "name": "市梅" }, {
            "id": 427,
            "name": "顺德"
        }, { "id": 428, "name": "台山" }, { "id": 335, "name": "阳江" }, { "id": 342, "name": "云浮" }, {
            "id": 429,
            "name": "增城"
        }, { "id": 336, "name": "湛江" }, { "id": 338, "name": "肇庆" }, { "id": 332, "name": "中山" }, { "id": 324, "name": "珠海" }]
    }, {
        "id": "25",
        "name": "广西",
        "cities": [{ "id": 351, "name": "百色" }, { "id": 346, "name": "北海" }, { "id": 355, "name": "崇左" }, {
            "id": 347,
            "name": "防城港"
        }, { "id": 349, "name": "贵港" }, { "id": 344, "name": "桂林" }, { "id": 353, "name": "河池" }, {
            "id": 352,
            "name": "贺州"
        }, { "id": 354, "name": "来宾" }, { "id": 343, "name": "柳州" }, { "id": 86, "name": "南宁" }, {
            "id": 348,
            "name": "钦州"
        }, { "id": 345, "name": "梧州" }, { "id": 350, "name": "玉林" }]
    }, {
        "id": "29",
        "name": "贵州",
        "cities": [{ "id": 400, "name": "安顺" }, { "id": 402, "name": "毕节地区" }, { "id": 432, "name": "都匀" }, {
            "id": 91,
            "name": "贵阳"
        }, { "id": 433, "name": "贵恙" }, { "id": 434, "name": "凯里" }, { "id": 398, "name": "六盘水" }, {
            "id": 404,
            "name": "黔东南苗族侗族自治州"
        }, { "id": 405, "name": "黔南布依族苗族自治州" }, { "id": 403, "name": "黔西南布依族苗族自治州" }, { "id": 435, "name": "铜仁" }, {
            "id": 401,
            "name": "铜仁地区"
        }, { "id": 399, "name": "遵义" }]
    }, {
        "id": "31",
        "name": "海南",
        "cities": [{ "id": 536, "name": "儋州市" }, { "id": 541, "name": "东方市" }, { "id": 93, "name": "海口" }, {
            "id": 533,
            "name": "龙华区"
        }, { "id": 535, "name": "美兰区" }, { "id": 539, "name": "琼海市" }, { "id": 532, "name": "琼山区" }, {
            "id": 94,
            "name": "三亚"
        }, { "id": 540, "name": "万宁市" }, { "id": 538, "name": "文昌市" }, { "id": 537, "name": "五指山市" }, { "id": 534, "name": "秀英区" }]
    }, {
        "id": "14",
        "name": "河北",
        "cities": [{ "id": 436, "name": "霸州" }, { "id": 69, "name": "保定" }, { "id": 211, "name": "沧州" }, {
            "id": 210,
            "name": "承德"
        }, { "id": 207, "name": "邯郸" }, { "id": 213, "name": "衡水" }, { "id": 212, "name": "廊坊" }, {
            "id": 206,
            "name": "秦皇岛"
        }, { "id": 437, "name": "青县" }, { "id": 438, "name": "任丘" }, { "id": 68, "name": "石家庄" }, {
            "id": 205,
            "name": "唐山"
        }, { "id": 208, "name": "邢台" }, { "id": 209, "name": "张家口" }, { "id": 439, "name": "涿州" }]
    }, {
        "id": "15",
        "name": "河南",
        "cities": [{ "id": 219, "name": "安阳" }, { "id": 217, "name": "鹤壁" }, { "id": 216, "name": "焦作" }, {
            "id": 214,
            "name": "开封"
        }, { "id": 71, "name": "洛阳" }, { "id": 222, "name": "漯河" }, { "id": 224, "name": "南阳" }, {
            "id": 215,
            "name": "平顶山"
        }, { "id": 220, "name": "濮阳" }, { "id": 223, "name": "三门峡" }, { "id": 225, "name": "商丘" }, {
            "id": 218,
            "name": "新乡"
        }, { "id": 226, "name": "信阳" }, { "id": 221, "name": "许昌" }, { "id": 70, "name": "郑州" }, {
            "id": 227,
            "name": "周口"
        }, { "id": 228, "name": "驻马店" }]
    }, {
        "id": "5",
        "name": "黑龙江",
        "cities": [{ "id": 130, "name": "大庆" }, { "id": 136, "name": "大兴安岭地区" }, { "id": 50, "name": "哈尔滨" }, {
            "id": 127,
            "name": "鹤岗"
        }, { "id": 134, "name": "黑河" }, { "id": 129, "name": "鸡西" }, { "id": 132, "name": "佳木斯" }, {
            "id": 52,
            "name": "牡丹江"
        }, { "id": 133, "name": "七台河" }, { "id": 51, "name": "齐齐哈尔" }, { "id": 128, "name": "双鸭山" }, {
            "id": 135,
            "name": "绥化"
        }, { "id": 131, "name": "伊春" }]
    }, {
        "id": "18",
        "name": "湖北",
        "cities": [{ "id": 440, "name": "安陆" }, { "id": 258, "name": "鄂州" }, { "id": 441, "name": "恩施" }, {
            "id": 263,
            "name": "恩施土家族苗族自治州"
        }, { "id": 442, "name": "汉口" }, { "id": 443, "name": "汉阳" }, { "id": 260, "name": "黄冈" }, {
            "id": 252,
            "name": "黄石"
        }, { "id": 257, "name": "荆门" }, { "id": 255, "name": "荆州" }, { "id": 444, "name": "潜江" }, {
            "id": 254,
            "name": "十堰"
        }, { "id": 262, "name": "随州" }, { "id": 77, "name": "武汉" }, { "id": 445, "name": "仙桃" }, {
            "id": 261,
            "name": "咸宁"
        }, { "id": 253, "name": "襄樊" }, { "id": 259, "name": "孝感" }, { "id": 256, "name": "宜昌" }, { "id": 446, "name": "株州" }]
    }, {
        "id": "19",
        "name": "湖南",
        "cities": [{ "id": 78, "name": "长沙" }, { "id": 269, "name": "常德" }, { "id": 272, "name": "郴州" }, {
            "id": 266,
            "name": "衡阳"
        }, { "id": 274, "name": "怀化" }, { "id": 275, "name": "娄底" }, { "id": 448, "name": "邵东" }, {
            "id": 267,
            "name": "邵阳"
        }, { "id": 265, "name": "湘潭" }, { "id": 276, "name": "湘西土家族苗族自治州" }, { "id": 271, "name": "益阳" }, {
            "id": 273,
            "name": "永州"
        }, { "id": 268, "name": "岳阳" }, { "id": 270, "name": "张家界" }, { "id": 447, "name": "株州" }, { "id": 264, "name": "株洲" }]
    }, {
        "id": "6",
        "name": "吉林",
        "cities": [{ "id": 142, "name": "白城" }, { "id": 140, "name": "白山" }, { "id": 53, "name": "长春" }, {
            "id": 449,
            "name": "高新"
        }, { "id": 54, "name": "吉林" }, { "id": 138, "name": "辽源" }, { "id": 451, "name": "梅河口" }, {
            "id": 137,
            "name": "四平"
        }, { "id": 141, "name": "松原" }, { "id": 139, "name": "通化" }, { "id": 143, "name": "延边朝鲜族自治州" }, { "id": 450, "name": "延吉" }]
    }, {
        "id": "21",
        "name": "江苏",
        "cities": [{ "id": 452, "name": "常熟" }, { "id": 301, "name": "常州" }, { "id": 453, "name": "丹阳" }, {
            "id": 454,
            "name": "海门"
        }, { "id": 294, "name": "淮安" }, { "id": 455, "name": "江都" }, { "id": 456, "name": "江阴" }, {
            "id": 457,
            "name": "靖江"
        }, { "id": 458, "name": "昆山" }, { "id": 459, "name": "溧阳" }, { "id": 293, "name": "连云港" }, {
            "id": 81,
            "name": "南京"
        }, { "id": 299, "name": "南通" }, { "id": 303, "name": "苏州" }, { "id": 295, "name": "宿迁" }, {
            "id": 460,
            "name": "太仓"
        }, { "id": 298, "name": "泰州" }, { "id": 461, "name": "泰州华" }, { "id": 302, "name": "无锡" }, {
            "id": 462,
            "name": "吴江"
        }, { "id": 463, "name": "吴县" }, { "id": 292, "name": "徐州" }, { "id": 296, "name": "盐城" }, {
            "id": 297,
            "name": "扬州"
        }, { "id": 464, "name": "宜兴" }, { "id": 465, "name": "张家港" }, { "id": 300, "name": "镇江" }]
    }, {
        "id": "23",
        "name": "江西",
        "cities": [{ "id": 322, "name": "抚州" }, { "id": 319, "name": "赣州" }, { "id": 466, "name": "高安" }, {
            "id": 320,
            "name": "吉安"
        }, { "id": 314, "name": "景德镇" }, { "id": 317, "name": "九江" }, { "id": 83, "name": "南昌" }, {
            "id": 315,
            "name": "萍乡"
        }, { "id": 323, "name": "上饶" }, { "id": 316, "name": "新余" }, { "id": 321, "name": "宜春" }, { "id": 318, "name": "鹰潭" }]
    }, {
        "id": "7",
        "name": "辽宁",
        "cities": [{ "id": 144, "name": "鞍山" }, { "id": 146, "name": "本溪" }, { "id": 154, "name": "朝阳" }, {
            "id": 56,
            "name": "大连"
        }, { "id": 147, "name": "丹东" }, { "id": 145, "name": "抚顺" }, { "id": 151, "name": "阜新" }, {
            "id": 148,
            "name": "葫芦岛"
        }, { "id": 57, "name": "锦州" }, { "id": 152, "name": "辽阳" }, { "id": 150, "name": "盘锦" }, {
            "id": 55,
            "name": "沈阳"
        }, { "id": 153, "name": "铁岭" }, { "id": 467, "name": "瓦房店" }, { "id": 149, "name": "营口" }]
    }, {
        "id": "8",
        "name": "内蒙古",
        "cities": [{ "id": 163, "name": "阿拉善盟" }, { "id": 468, "name": "巴彦淖尔" }, { "id": 162, "name": "巴彦淖尔盟" }, {
            "id": 59,
            "name": "包头"
        }, { "id": 156, "name": "赤峰" }, { "id": 158, "name": "鄂尔多斯" }, { "id": 58, "name": "呼和浩特" }, {
            "id": 469,
            "name": "呼伦贝尔"
        }, { "id": 470, "name": "集宁" }, { "id": 157, "name": "通辽" }, { "id": 155, "name": "乌海" }, {
            "id": 160,
            "name": "乌兰察布盟"
        }, { "id": 471, "name": "乌兰浩特" }, { "id": 161, "name": "锡林郭勒盟" }, { "id": 472, "name": "锡林浩特" }, {
            "id": 164,
            "name": "兴安盟"
        }]
    }, {
        "id": "9",
        "name": "宁夏",
        "cities": [{ "id": 167, "name": "固原" }, { "id": 165, "name": "石嘴山" }, { "id": 166, "name": "吴忠" }, {
            "id": 60,
            "name": "银川"
        }]
    }, {
        "id": "11",
        "name": "青海",
        "cities": [{ "id": 473, "name": "格尔木" }, { "id": 183, "name": "果洛藏族自治州" }, { "id": 180, "name": "海北藏族自治州" }, {
            "id": 179,
            "name": "海东地区"
        }, { "id": 182, "name": "海南藏族自治州" }, { "id": 185, "name": "海西蒙古族藏族自治州" }, { "id": 181, "name": "黄南藏族自治州" }, {
            "id": 62,
            "name": "西宁"
        }, { "id": 184, "name": "玉树藏族自治州" }]
    }, {
        "id": "16",
        "name": "山东",
        "cities": [{ "id": 241, "name": "滨州" }, { "id": 238, "name": "德州" }, { "id": 231, "name": "东营" }, {
            "id": 474,
            "name": "高密"
        }, { "id": 475, "name": "荷泽" }, { "id": 242, "name": "菏泽" }, { "id": 476, "name": "淮坊" }, {
            "id": 477,
            "name": "即墨"
        }, { "id": 72, "name": "济南" }, { "id": 234, "name": "济宁" }, { "id": 478, "name": "胶南" }, {
            "id": 237,
            "name": "莱芜"
        }, { "id": 479, "name": "莱州" }, { "id": 240, "name": "聊城" }, { "id": 480, "name": "林沂" }, {
            "id": 481,
            "name": "临忻"
        }, { "id": 239, "name": "临沂" }, { "id": 482, "name": "龙口" }, { "id": 483, "name": "蓬莱" }, {
            "id": 73,
            "name": "青岛"
        }, { "id": 484, "name": "青州" }, { "id": 236, "name": "日照" }, { "id": 485, "name": "乳山" }, {
            "id": 486,
            "name": "寿光"
        }, { "id": 235, "name": "泰安" }, { "id": 487, "name": "滕州" }, { "id": 233, "name": "威海" }, {
            "id": 232,
            "name": "潍坊"
        }, { "id": 488, "name": "文登" }, { "id": 74, "name": "烟台" }, { "id": 230, "name": "枣庄" }, {
            "id": 489,
            "name": "招远"
        }, { "id": 229, "name": "淄博" }]
    }, {
        "id": "17",
        "name": "山西",
        "cities": [{ "id": 245, "name": "长治" }, { "id": 76, "name": "大同" }, { "id": 491, "name": "河津" }, {
            "id": 492,
            "name": "侯马"
        }, { "id": 246, "name": "晋城" }, { "id": 248, "name": "晋中" }, { "id": 249, "name": "临汾" }, {
            "id": 251,
            "name": "吕梁地区"
        }, { "id": 243, "name": "朔州" }, { "id": 75, "name": "太原" }, { "id": 494, "name": "孝义" }, {
            "id": 247,
            "name": "忻州"
        }, { "id": 244, "name": "阳泉" }, { "id": 495, "name": "榆次" }, { "id": 250, "name": "运城" }]
    }, {
        "id": "13",
        "name": "陕西",
        "cities": [{ "id": 203, "name": "安康" }, { "id": 66, "name": "宝鸡" }, { "id": 496, "name": "韩城" }, {
            "id": 201,
            "name": "汉中"
        }, { "id": 204, "name": "商洛" }, { "id": 198, "name": "铜川" }, { "id": 200, "name": "渭南" }, {
            "id": 65,
            "name": "西安"
        }, { "id": 199, "name": "咸阳" }, { "id": 67, "name": "延安" }, { "id": 202, "name": "榆林" }]
    }, {
        "id": "2",
        "name": "上海",
        "cities": [{ "id": 29, "name": "宝山区" }, { "id": 22, "name": "长宁区" }, { "id": 37, "name": "崇明县" }, {
            "id": 35,
            "name": "奉贤县"
        }, { "id": 27, "name": "虹口区" }, { "id": 18, "name": "黄浦区" }, { "id": 31, "name": "嘉定区" }, {
            "id": 25,
            "name": "金山区"
        }, { "id": 23, "name": "静安区" }, { "id": 20, "name": "卢湾区" }, { "id": 30, "name": "闵行区" }, {
            "id": 36,
            "name": "南汇县"
        }, { "id": 19, "name": "南市区" }, { "id": 33, "name": "浦东新区" }, { "id": 24, "name": "普陀区" }, {
            "id": 34,
            "name": "青浦县"
        }, { "id": 32, "name": "松江区" }, { "id": 21, "name": "徐汇区" }, { "id": 28, "name": "杨浦区" }, { "id": 26, "name": "闸北区" }]
    }, {
        "id": "27",
        "name": "四川",
        "cities": [{ "id": 380, "name": "阿坝藏族羌族自治州" }, { "id": 376, "name": "巴中" }, { "id": 89, "name": "成都" }, {
            "id": 375,
            "name": "达州"
        }, { "id": 366, "name": "德阳" }, { "id": 381, "name": "甘孜藏族自治州" }, { "id": 374, "name": "广安" }, {
            "id": 497,
            "name": "广汉"
        }, { "id": 368, "name": "广元" }, { "id": 498, "name": "锦阳" }, { "id": 371, "name": "乐山" }, {
            "id": 382,
            "name": "凉山彝族自治州"
        }, { "id": 365, "name": "泸州" }, { "id": 378, "name": "眉山" }, { "id": 367, "name": "绵阳" }, {
            "id": 370,
            "name": "内江"
        }, { "id": 372, "name": "南充" }, { "id": 364, "name": "攀枝花" }, { "id": 369, "name": "遂宁" }, {
            "id": 499,
            "name": "西昌"
        }, { "id": 377, "name": "雅安" }, { "id": 373, "name": "宜宾" }, { "id": 379, "name": "资阳" }, { "id": 363, "name": "自贡" }]
    }, {
        "id": "34",
        "name": "台湾",
        "cities": [{ "id": 98, "name": "高雄" }, { "id": 101, "name": "基隆" }, { "id": 97, "name": "台北" }, {
            "id": 100,
            "name": "台南"
        }, { "id": 99, "name": "台中" }, { "id": 102, "name": "新竹" }]
    }, {
        "id": "3",
        "name": "天津",
        "cities": [{ "id": 111, "name": "宝坻区" }, { "id": 109, "name": "北辰区" }, { "id": 105, "name": "大港区" }, {
            "id": 106,
            "name": "东丽区"
        }, { "id": 45, "name": "汉沽区" }, { "id": 38, "name": "和平区" }, { "id": 41, "name": "河北区" }, {
            "id": 39,
            "name": "河东区"
        }, { "id": 40, "name": "河西区" }, { "id": 43, "name": "红桥区" }, { "id": 112, "name": "蓟县" }, {
            "id": 108,
            "name": "津南区"
        }, { "id": 114, "name": "静海县" }, { "id": 42, "name": "南开区" }, { "id": 113, "name": "宁河县" }, {
            "id": 44,
            "name": "塘沽区"
        }, { "id": 110, "name": "武清区" }, { "id": 107, "name": "西青区" }]
    }, {
        "id": "30",
        "name": "西藏",
        "cities": [{ "id": 410, "name": "阿里地区" }, { "id": 407, "name": "昌都地区" }, { "id": 92, "name": "拉萨" }, {
            "id": 411,
            "name": "林芝地区"
        }, { "id": 406, "name": "那曲地区" }, { "id": 409, "name": "日喀则地区" }, { "id": 408, "name": "山南地区" }]
    }, { "id": "32", "name": "香港", "cities": [{ "id": 95, "name": "香港" }] }, {
        "id": "10",
        "name": "新疆",
        "cities": [{ "id": 500, "name": "阿克苏" }, { "id": 172, "name": "阿克苏地区" }, { "id": 175, "name": "巴音郭楞蒙古自治州" }, {
            "id": 177,
            "name": "博尔塔拉蒙古自治州"
        }, { "id": 501, "name": "昌吉" }, { "id": 176, "name": "昌吉回族自治州" }, { "id": 502, "name": "哈密" }, {
            "id": 170,
            "name": "哈密地区"
        }, { "id": 503, "name": "和田" }, { "id": 171, "name": "和田地区" }, { "id": 504, "name": "喀什" }, {
            "id": 173,
            "name": "喀什地区"
        }, { "id": 505, "name": "克拉马依" }, { "id": 168, "name": "克拉玛依" }, { "id": 174, "name": "克孜勒苏柯尔克孜自治州" }, {
            "id": 506,
            "name": "库尔勒"
        }, { "id": 510, "name": "奎屯" }, { "id": 507, "name": "石河子" }, { "id": 508, "name": "吐鲁番" }, {
            "id": 169,
            "name": "吐鲁番地区"
        }, { "id": 61, "name": "乌鲁木齐" }, { "id": 509, "name": "乌市" }, { "id": 511, "name": "伊犁" }, {
            "id": 178,
            "name": "伊犁哈萨克自治州"
        }, { "id": 512, "name": "伊宁" }]
    }, {
        "id": "28",
        "name": "云南",
        "cities": [{ "id": 385, "name": "保山" }, { "id": 393, "name": "楚雄彝族自治州" }, { "id": 513, "name": "大理" }, {
            "id": 394,
            "name": "大理白族自治州"
        }, { "id": 395, "name": "德宏傣族景颇族自治州" }, { "id": 397, "name": "迪庆藏族自治州" }, { "id": 391, "name": "红河哈尼族彝族自治州" }, {
            "id": 90,
            "name": "昆明"
        }, { "id": 389, "name": "丽江" }, { "id": 388, "name": "临沧地区" }, { "id": 396, "name": "怒江傈傈族自治州" }, {
            "id": 383,
            "name": "曲靖"
        }, { "id": 387, "name": "思茅地区" }, { "id": 390, "name": "文山壮族苗族自治州" }, { "id": 392, "name": "西双版纳傣族自治州" }, {
            "id": 384,
            "name": "玉溪"
        }, { "id": 386, "name": "昭通" }]
    }, {
        "id": "22",
        "name": "浙江",
        "cities": [{ "id": 514, "name": "慈溪" }, { "id": 515, "name": "东阳" }, { "id": 516, "name": "奉化" }, {
            "id": 82,
            "name": "杭州"
        }, { "id": 307, "name": "湖州" }, { "id": 306, "name": "嘉兴" }, { "id": 309, "name": "金华" }, {
            "id": 517,
            "name": "乐清"
        }, { "id": 313, "name": "丽水" }, { "id": 518, "name": "临安" }, { "id": 519, "name": "临海" }, {
            "id": 304,
            "name": "宁波"
        }, { "id": 520, "name": "平湖" }, { "id": 310, "name": "衢州" }, { "id": 521, "name": "瑞安" }, {
            "id": 522,
            "name": "上虞"
        }, { "id": 308, "name": "绍兴" }, { "id": 523, "name": "嵊州" }, { "id": 312, "name": "台州" }, {
            "id": 524,
            "name": "温岭"
        }, { "id": 305, "name": "温州" }, { "id": 529, "name": "新昌" }, { "id": 525, "name": "义乌" }, {
            "id": 526,
            "name": "永康"
        }, { "id": 527, "name": "余姚" }, { "id": 311, "name": "舟山" }, { "id": 528, "name": "诸暨" }]
    }, {
        "id": "4",
        "name": "重庆",
        "cities": [{ "id": 125, "name": "巴南区" }, { "id": 121, "name": "北碚区" }, { "id": 531, "name": "璧山区" }, {
            "id": 126,
            "name": "长寿区"
        }, { "id": 116, "name": "大渡口区" }, { "id": 48, "name": "涪陵区" }, { "id": 530, "name": "合川区" }, {
            "id": 117,
            "name": "江北区"
        }, { "id": 119, "name": "九龙坡区" }, { "id": 120, "name": "南岸区" }, { "id": 542, "name": "南川区" }, {
            "id": 47,
            "name": "黔江区"
        }, { "id": 118, "name": "沙坪坝区" }, { "id": 123, "name": "双桥区" }, { "id": 122, "name": "万盛区" }, {
            "id": 49,
            "name": "万洲区"
        }, { "id": 46, "name": "永川市" }, { "id": 124, "name": "渝北区" }, { "id": 115, "name": "渝中区" },
        { "id": 600, "name": "江津区" }]
    }];
